lifely-cc/agruminoLemon-libraries/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.ESPModule=Module
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.wipe=Erase Flash
menu.sdk=Espressif FW
menu.ssl=SSL Support

##############################################################
agrumino_lemonv4.name=Agrumino Lemon v4 (WT8266-S1 Module)
agrumino_lemonv4.build.board=ESP8266_AGRUMINO_LEMON_V4
agrumino_lemonv4.build.variant=lemonv4
agrumino_lemonv4.upload.tool=esptool
agrumino_lemonv4.upload.maximum_data_size=81920
agrumino_lemonv4.upload.wait_for_upload_port=true
agrumino_lemonv4.upload.erase_cmd=
agrumino_lemonv4.serial.disableDTR=true
agrumino_lemonv4.serial.disableRTS=true
agrumino_lemonv4.build.mcu=esp8266
agrumino_lemonv4.build.core=esp8266
agrumino_lemonv4.build.spiffs_pagesize=256
agrumino_lemonv4.build.debug_port=
agrumino_lemonv4.build.debug_level=
agrumino_lemonv4.menu.xtal.80=80 MHz
agrumino_lemonv4.menu.xtal.80.build.f_cpu=80000000L
agrumino_lemonv4.menu.xtal.160=160 MHz
agrumino_lemonv4.menu.xtal.160.build.f_cpu=160000000L
agrumino_lemonv4.menu.vt.flash=Flash
agrumino_lemonv4.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
agrumino_lemonv4.menu.vt.heap=Heap
agrumino_lemonv4.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
agrumino_lemonv4.menu.vt.iram=IRAM
agrumino_lemonv4.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
agrumino_lemonv4.menu.exception.legacy=Legacy (new can return nullptr)
agrumino_lemonv4.menu.exception.legacy.build.exception_flags=-fno-exceptions
agrumino_lemonv4.menu.exception.legacy.build.stdcpp_lib=-lstdc++
agrumino_lemonv4.menu.exception.disabled=Disabled (new can abort)
agrumino_lemonv4.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
agrumino_lemonv4.menu.exception.disabled.build.stdcpp_lib=-lstdc++
agrumino_lemonv4.menu.exception.enabled=Enabled
agrumino_lemonv4.menu.exception.enabled.build.exception_flags=-fexceptions
agrumino_lemonv4.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
agrumino_lemonv4.menu.ssl.all=All SSL ciphers (most compatible)
agrumino_lemonv4.menu.ssl.all.build.sslflags=
agrumino_lemonv4.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
agrumino_lemonv4.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
agrumino_lemonv4.upload.resetmethod=--before default_reset --after hard_reset
agrumino_lemonv4.build.flash_mode=dio
agrumino_lemonv4.build.flash_flags=-DFLASHMODE_DIO
agrumino_lemonv4.build.flash_freq=40
agrumino_lemonv4.menu.eesz.2M=2MB (FS:none OTA:~1008KB)
agrumino_lemonv4.menu.eesz.2M.build.flash_size=2M
agrumino_lemonv4.menu.eesz.2M.build.flash_size_bytes=0x200000
agrumino_lemonv4.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
agrumino_lemonv4.menu.eesz.2M.build.spiffs_pagesize=256
agrumino_lemonv4.menu.eesz.2M.upload.maximum_size=1044464
agrumino_lemonv4.menu.eesz.2M.build.rfcal_addr=0x1FC000
agrumino_lemonv4.menu.led.2=2
agrumino_lemonv4.menu.led.2.build.led=-DLED_BUILTIN=2
agrumino_lemonv4.menu.led.16=16
agrumino_lemonv4.menu.led.16.build.led=-DLED_BUILTIN=16
agrumino_lemonv4.menu.ip.lm2f=v2 Lower Memory
agrumino_lemonv4.menu.ip.lm2f.build.lwip_include=lwip2/include
agrumino_lemonv4.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
agrumino_lemonv4.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
agrumino_lemonv4.menu.ip.hb2f=v2 Higher Bandwidth
agrumino_lemonv4.menu.ip.hb2f.build.lwip_include=lwip2/include
agrumino_lemonv4.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
agrumino_lemonv4.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
agrumino_lemonv4.menu.ip.lm2n=v2 Lower Memory (no features)
agrumino_lemonv4.menu.ip.lm2n.build.lwip_include=lwip2/include
agrumino_lemonv4.menu.ip.lm2n.build.lwip_lib=-llwip2-536
agrumino_lemonv4.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
agrumino_lemonv4.menu.ip.hb2n=v2 Higher Bandwidth (no features)
agrumino_lemonv4.menu.ip.hb2n.build.lwip_include=lwip2/include
agrumino_lemonv4.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
agrumino_lemonv4.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
agrumino_lemonv4.menu.ip.lm6f=v2 IPv6 Lower Memory
agrumino_lemonv4.menu.ip.lm6f.build.lwip_include=lwip2/include
agrumino_lemonv4.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
agrumino_lemonv4.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
agrumino_lemonv4.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
agrumino_lemonv4.menu.ip.hb6f.build.lwip_include=lwip2/include
agrumino_lemonv4.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
agrumino_lemonv4.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
agrumino_lemonv4.menu.ip.hb1=v1.4 Higher Bandwidth
agrumino_lemonv4.menu.ip.hb1.build.lwip_lib=-llwip_gcc
agrumino_lemonv4.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
agrumino_lemonv4.menu.ip.src=v1.4 Compile from source
agrumino_lemonv4.menu.ip.src.build.lwip_lib=-llwip_src
agrumino_lemonv4.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
agrumino_lemonv4.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
agrumino_lemonv4.menu.dbg.Disabled=Disabled
agrumino_lemonv4.menu.dbg.Disabled.build.debug_port=
agrumino_lemonv4.menu.dbg.Serial=Serial
agrumino_lemonv4.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
agrumino_lemonv4.menu.dbg.Serial1=Serial1
agrumino_lemonv4.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
agrumino_lemonv4.menu.lvl.None____=None
agrumino_lemonv4.menu.lvl.None____.build.debug_level=
agrumino_lemonv4.menu.lvl.SSL=SSL
agrumino_lemonv4.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
agrumino_lemonv4.menu.lvl.TLS_MEM=TLS_MEM
agrumino_lemonv4.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
agrumino_lemonv4.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
agrumino_lemonv4.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
agrumino_lemonv4.menu.lvl.HTTP_SERVER=HTTP_SERVER
agrumino_lemonv4.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
agrumino_lemonv4.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
agrumino_lemonv4.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
agrumino_lemonv4.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
agrumino_lemonv4.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
agrumino_lemonv4.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
agrumino_lemonv4.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
agrumino_lemonv4.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
agrumino_lemonv4.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
agrumino_lemonv4.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino_lemonv4.menu.lvl.CORE=CORE
agrumino_lemonv4.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
agrumino_lemonv4.menu.lvl.WIFI=WIFI
agrumino_lemonv4.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
agrumino_lemonv4.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
agrumino_lemonv4.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
agrumino_lemonv4.menu.lvl.UPDATER=UPDATER
agrumino_lemonv4.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
agrumino_lemonv4.menu.lvl.OTA=OTA
agrumino_lemonv4.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
agrumino_lemonv4.menu.lvl.OOM=OOM
agrumino_lemonv4.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
agrumino_lemonv4.menu.lvl.MDNS=MDNS
agrumino_lemonv4.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
agrumino_lemonv4.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
agrumino_lemonv4.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
agrumino_lemonv4.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
agrumino_lemonv4.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
agrumino_lemonv4.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
agrumino_lemonv4.menu.wipe.none=Only Sketch
agrumino_lemonv4.menu.wipe.none.upload.erase_cmd=
agrumino_lemonv4.menu.wipe.sdk=Sketch + WiFi Settings
agrumino_lemonv4.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
agrumino_lemonv4.menu.wipe.all=All Flash Contents
agrumino_lemonv4.menu.wipe.all.upload.erase_cmd=erase_flash
agrumino_lemonv4.menu.baud.115200=115200
agrumino_lemonv4.menu.baud.115200.upload.speed=115200
agrumino_lemonv4.menu.baud.57600=57600
agrumino_lemonv4.menu.baud.57600.upload.speed=57600
agrumino_lemonv4.menu.baud.230400.linux=230400
agrumino_lemonv4.menu.baud.230400.macosx=230400
agrumino_lemonv4.menu.baud.230400.upload.speed=230400
agrumino_lemonv4.menu.baud.256000.windows=256000
agrumino_lemonv4.menu.baud.256000.upload.speed=256000
agrumino_lemonv4.menu.baud.460800.linux=460800
agrumino_lemonv4.menu.baud.460800.macosx=460800
agrumino_lemonv4.menu.baud.460800.upload.speed=460800
agrumino_lemonv4.menu.baud.512000.windows=512000
agrumino_lemonv4.menu.baud.512000.upload.speed=512000
agrumino_lemonv4.menu.baud.921600=921600
agrumino_lemonv4.menu.baud.921600.upload.speed=921600
agrumino_lemonv4.menu.baud.3000000=3000000
agrumino_lemonv4.menu.baud.3000000.upload.speed=3000000

